controllers/webservices/our/ws_All/testes/NewFile.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns1="vokiWebService" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
	SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:getStatusDoProdutoVendido>
			<parametros xsi:type="ns1:arrParametros">
				<arrParametros xsi:type="ns1:arrParametrosType">
					<codigoDoProdutoVendido xsi:type="xsd:string">2</codigoDoProdutoVendido>
					<codigoDeSequenciaDoProdutoVendido
						xsi:type="xsd:string">20</codigoDeSequenciaDoProdutoVendido>
				</arrParametros>
				<arrParametros xsi:type="ns1:arrParametrosType">
					<codigoDoProdutoVendido xsi:type="xsd:string">2</codigoDoProdutoVendido>
					<codigoDeSequenciaDoProdutoVendido
						xsi:type="xsd:string">20</codigoDeSequenciaDoProdutoVendido>
				</arrParametros>
			</parametros>
		</ns1:getStatusDoProdutoVendido>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
